Revit 2024 API
BuiltInFailures.MEPFabricationFailures Class
 Failures about MEP fabrication.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class MEPFabricationFailures
Visual Basic
Public NotInheritable Class MEPFabricationFailures
Visual C++
public ref class MEPFabricationFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures
See Also
BuiltInFailures.MEPFabricationFailures Members
Autodesk.Revit.DB Namespace